---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BarTypeDiameterOptions
source: html/e3528ef9-fdd0-f820-3e39-51879671bd0f.htm
---
# BarTypeDiameterOptions Members

Constructs a new BarTypeDiameterOptions with default settings.